# IsMeshAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MeshFromGeometryOperationResult..::..IsMeshAvailable Property
MeshFromGeometryOperationResult Class See Also
---
Shows whether the result still contains the mesh which was constructed, if any, or whether it has been relinquished by 'getMesh'. The former is true, the later is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsMeshAvailable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsMeshAvailable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsMeshAvailable {
	bool get ();
}
```

# See Also
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace